## Connect to Db2 Database

In [4]:
%load_ext sql
%sql ibm_db_sa://gtx81096:n97vjc1cm4b6d@4q@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: gtx81096@BLUDB'

### Create Pet Sale Table  
Create the PETSALE table and populate the table with data.

In [5]:
#Drop the PETSALE table in case it exists
%sql drop table PETSALE;

#Create the PETSALE table 
%sql create table PETSALE \
(ID INTEGER PRIMARY KEY NOT NULL, ANIMAL VARCHAR(20), QUANTITY INTEGER, \
SALEPRICE DECIMAL(6,2), SALEDATE DATE);

#Insert sample data into PETSALE table
%sql insert into PETSALE values (1,'Cat',9,450.09,'2018-05-29'), (2,'Dog',3,666.66,'2018-06-01'), \
(3,'Dog',1,100.00,'2018-06-04'), (4,'Parrot',2,50.00,'2018-06-04'), (5,'Dog',1,75.75,'2018-06-10'), \
(6,'Hamster',6,60.60,'2018-06-11'), (7,'Cat',1,44.44,'2018-06-11'), \
(8,'Goldfish',24,48.48,'2018-06-14'), (9,'Dog',2,222.22,'2018-06-15');

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.
 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.
 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
9 rows affected.

[]

In [14]:
%sql select * from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(1, 'Cat', 9, Decimal('450.09'), datetime.date(2018, 5, 29)),
 (2, 'Dog', 3, Decimal('666.66'), datetime.date(2018, 6, 1)),
 (3, 'Dog', 1, Decimal('100.00'), datetime.date(2018, 6, 4)),
 (4, 'Parrot', 2, Decimal('50.00'), datetime.date(2018, 6, 4)),
 (5, 'Dog', 1, Decimal('75.75'), datetime.date(2018, 6, 10)),
 (6, 'Hamster', 6, Decimal('60.60'), datetime.date(2018, 6, 11)),
 (7, 'Cat', 1, Decimal('44.44'), datetime.date(2018, 6, 11)),
 (8, 'Goldfish', 24, Decimal('48.48'), datetime.date(2018, 6, 14)),
 (9, 'Dog', 2, Decimal('222.22'), datetime.date(2018, 6, 15))]

## Query the Db

In [7]:
#Total sales
%sql select SUM(SALEPRICE) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('1718.24'),)]

In [8]:
#Total sales labeled as SUM_OF_SALEPRICE
%sql select SUM(SALEPRICE) AS SUM_OF_SALEPRICE from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('1718.24'),)]

In [9]:
#Maximum number sold
%sql select MAX(QUANTITY) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(24,)]

In [10]:
#Average sales
%sql select CAST(ROUND(AVG(SALEPRICE), 2) as float) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(190.92,)]

In [11]:
#Average sale price per dog
%sql select CAST(ROUND(AVG( SALEPRICE / QUANTITY ), 2) as float) from PETSALE where ANIMAL = 'Dog';

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(127.27,)]

In [12]:
#Sale price per entry rounded
%sql select ROUND(SALEPRICE) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('450.00'),),
 (Decimal('667.00'),),
 (Decimal('100.00'),),
 (Decimal('50.00'),),
 (Decimal('76.00'),),
 (Decimal('61.00'),),
 (Decimal('44.00'),),
 (Decimal('48.00'),),
 (Decimal('222.00'),)]

In [13]:
#Length of each string in the ANIMAL column
%sql select LENGTH(ANIMAL) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(3,), (3,), (3,), (6,), (3,), (7,), (3,), (8,), (3,)]

In [19]:
#Select animals converted to upper case
%sql select UCASE(ANIMAL) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('CAT',),
 ('DOG',),
 ('DOG',),
 ('PARROT',),
 ('DOG',),
 ('HAMSTER',),
 ('CAT',),
 ('GOLDFISH',),
 ('DOG',)]

In [20]:
#Select unique animals converted to upper case
%sql select DISTINCT(UCASE(ANIMAL)) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('CAT',), ('DOG',), ('GOLDFISH',), ('HAMSTER',), ('PARROT',)]

In [21]:
#Select entries with animal cat (convert animal to lower case to find 'cat')
%sql select * from PETSALE where LCASE(ANIMAL) = 'cat';

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(1, 'Cat', 9, Decimal('450.09'), datetime.date(2018, 5, 29)),
 (7, 'Cat', 1, Decimal('44.44'), datetime.date(2018, 6, 11))]

In [22]:
#Select the day of the month for the sale date for cat entries
%sql select DAY(SALEDATE) from PETSALE where ANIMAL = 'Cat';

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(29,), (11,)]

In [23]:
#Count the number of entries for the month of May
%sql select COUNT(*) from PETSALE where MONTH(SALEDATE)='05';

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('1'),)]

In [24]:
#Select the sale date after adding 3 days to it
%sql select (SALEDATE + 3 DAYS) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(datetime.date(2018, 6, 1),),
 (datetime.date(2018, 6, 4),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 7),),
 (datetime.date(2018, 6, 13),),
 (datetime.date(2018, 6, 14),),
 (datetime.date(2018, 6, 14),),
 (datetime.date(2018, 6, 17),),
 (datetime.date(2018, 6, 18),)]

In [25]:
#Select the number of days since each sales date
%sql select (CURRENT DATE - SALEDATE) from PETSALE;

 * ibm_db_sa://gtx81096:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('525'),),
 (Decimal('522'),),
 (Decimal('519'),),
 (Decimal('519'),),
 (Decimal('513'),),
 (Decimal('512'),),
 (Decimal('512'),),
 (Decimal('509'),),
 (Decimal('508'),)]